0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];
#include        "../initialConditions";
internalField   uniform $flowVelocity;

boundaryField
{
    "(side|top)"
    {
        type            symmetryPlane;
    }
    symmetry
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }
    ground
    {
        type            translatingWallVelocity;
        U               $flowVelocity;
        value           uniform $flowVelocity;
    }
    DP_FW
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}
// ************************************************************************* //
