0/ka
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ka;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Campo adjoint di k (energia cinetica turbolenta adjoint)
// Inizializzato a zero — il solver lo calcola a partire dal campo primal k
// BC: logica adjoint — inlet/ground zeroGradient, outlet fixedValue 0

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        // Adjoint: inlet diventa uscita del segnale adjoint → zeroGradient
        type            zeroGradient;
    }
    outlet
    {
        // Adjoint: outlet diventa ingresso → fixedValue 0
        type            fixedValue;
        value           uniform 0;
    }
    ground
    {
        type            zeroGradient;
    }
    "(side|top)"
    {
        type            symmetryPlane;
    }
    symmetry
    {
        type            symmetryPlane;
    }
    DP_FW
    {
        // Parete: fixedValue 0 (condizione di non-penetrazione adjoint)
        type            fixedValue;
        value           uniform 0;
    }
}

// ************************************************************************* //
