constant/fanCurve_battery.txt
((0.000000000000 555.000000)
(0.000732071713 523.071066)
(0.001317729084 491.142132)
(0.001819721116 461.091371)
(0.002300796813 430.101523)
(0.002719123506 401.928934)
(0.003074701195 369.060914)
(0.003346613546 338.071066)
(0.003681274900 306.142132)
(0.003953187251 276.091371)
(0.004266932271 255.431472)
(0.005396414343 239.467005)
(0.006358565737 228.197970)
(0.007257968127 201.903553)
(0.008115537849 172.791878)
(0.009098605578 119.263959)
(0.009579681275 81.700508)
(0.009998007968 46.954315)
(0.010500000000 0.000000))