constant/fanCurve_radiator.txt
((0.00000000000	1490.000000)
(0.005962056024	1385.440613)
(0.013550135388	1256.704981)
(0.023035227204	1136.015326)
(0.034146342360	1004.597701)
(0.040650406164	908.045977)
(0.048238485528	773.94636)
(0.053658533772	661.302682)
(0.059891598612	578.160919)
(0.064769648928	548.659004)
(0.069918698208	556.704981)
(0.076151763048	564.750958)
(0.082384827888	572.796935)
(0.088617882876	572.796935)
(0.095392955496	559.386973)
(0.104336039532	529.885058)
(0.112737125640	486.97318)
(0.118970190480	444.061303)
(0.125474254284	374.329502)
(0.131707319124	299.233717)
(0.138482381892	234.8659)
(0.145257454512	146.360153)
(0.150406503792	76.628352)
(0.156944448624	0.0000000))
