system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;
xmin 	-2.0;
xmax	3.0;
ymin	0.0;
ymax	2.0;
zmin	0.0;
zmax	2.0;

vertices
(
    ($xmin $ymin $zmin)
	($xmax $ymin $zmin)
	($xmax $ymax $zmin)
	($xmin $ymax $zmin)

	($xmin $ymin $zmax)
	($xmax $ymin $zmax)
	($xmax $ymax $zmax)
	($xmin $ymax $zmax)
);

blocks
(
    // Tunnel di 5m x 2m x 2m, diviso in celle base da 10cm
    hex (0 1 2 3 4 5 6 7) (50 20 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    side
    {
        type symmetryPlane;
        faces ((3 7 6 2));
    }
    symmetry
    {
        type symmetryPlane; // Modificato in symmetryPlane per sicurezza
        faces ((1 5 4 0));
    }
    inlet
    {
        type patch;
        faces ((0 4 7 3));
    }
    outlet
    {
        type patch;
        faces ((2 6 5 1));
    }
    ground
    {
        type wall;
        faces ((0 3 2 1));
    }
    top
    {
        type symmetryPlane;
        faces ((4 5 6 7));
    }
);
// ************************************************************************* //
