system/functions/fileUpdate
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fileUpdate;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fileUpdate1
   {
     type              timeActivatedFileUpdate;
     libs              ("libutilityFunctionObjects.so");
     writeControl      timeStep;
     writeInterval     1;
     fileToUpdate      "$FOAM_CASE/system/fvSchemes";
     timeVsFile
     (
         // start with first order
         (-1 "$FOAM_CASE/system/fvSchemes_1")
         // after 100 iterations use second order
         (1000 "$FOAM_CASE/system/fvSchemes_2")  
     );
   }

fileUpdate2
   {
     type              timeActivatedFileUpdate;
     libs              ("libutilityFunctionObjects.so");
     writeControl      timeStep;
     writeInterval     1;
     fileToUpdate      "$FOAM_CASE/system/fvSolution";
     timeVsFile
     (
         // start with first order
         (-1 "$FOAM_CASE/system/fvSolution_1")
         // after 100 iterations use second order
         (1250 "$FOAM_CASE/system/fvSolution_2")
         (1500 "$FOAM_CASE/system/fvSolution_1")
         
     );
   }


// ************************************************************************* //
