system/fvSchemes_1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default cellMDLimited leastSquares 1;
    grad(p) cellMDLimited Gauss linear 1;
    grad(U) cellMDLimited leastSquares 1;
    grad(cellDisplacement)  Gauss linear;
}

divSchemes
{
    default         				none;
    div(phi,U)      				bounded Gauss linearUpwindV grad(U);
    div(phi,Ua)                                 bounded Gauss upwind;
    div(phi,k)     				bounded Gauss upwind;
    div(phi,omega)  				bounded Gauss upwind;
    div((nuEff*dev2(T(grad(U))))) 		Gauss linear;
    div(phi,Ua)                                 Gauss linearUpwind grad(Ua);
    div(-phi,Ua)                                Gauss linearUpwind grad(Ua);
    div(phi,pa)                                 Gauss linear;
    div((nuEff*dev(T(grad(Ua)))))               Gauss linear;
}

laplacianSchemes
{
  //default         Gauss linear corrected;
    default         Gauss linear limited 0.5;
    laplacian(diffusivity,cellDisplacement) Gauss linear limited 0.5;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
   //default			corrected;
  default         limited 0.5;
}



wallDist
{
    method meshWave;
}

// ************************************************************************* //
