system/fvSolution_1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
solvers
{
	p
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;
        smoother         GaussSeidel;
        nPreSweeps       1;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 1000;
        mergeLevels      1;
    }


	Phi
    {
        $p;
    }
    

	U
    {
	solver PBiCGStab;
	preconditioner DILU;
	tolerance 1e-6;
	relTol 0.01;
    } 
	pa { $p; }
	Ua { $U; }

	ma
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0.0;
    }

	cellDisplacement
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0;
    }

	k
    {
        solver           smoothSolver;
        smoother         symGaussSeidel;
        tolerance        1e-8;
        relTol           0.001;
        nSweeps          1;
    }


	omega
    {
        solver           smoothSolver;
        smoother         symGaussSeidel;
        tolerance        1e-8;
        relTol           0.001;
        nSweeps          1;
    }
}

SIMPLE
{
    nUCorrectors    3;
    nNonOrthogonalCorrectors 1;  
    pRefCell        0;
    pRefValue       0;

    residualControl
	{
        	U 		1e-07;
        	"p.*"	 	1e-06;
        	k 		1e-06;
        	omega 		1e-07;
    	}
	
    consistent yes;
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

relaxationFactors
{

    fields
    {
    	p		0.3;
	pa		0.3;
    }
    
    equations
    {
	p	   	0.5;
	U		0.5;
	Ua		0.5;
	k		0.5;
	omega		0.5;
        ma              0.5;
 }
}

cache
{
    grad(U);
}

// ************************************************************************* //
